Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.storage.clearChatHistory.message
source: All repo AI assistant chat sessions will be permanently removed. Knowledge RAG conversations are not affected. This action cannot be undone.
ar: ستُزال جميع جلسات محادثة مساعد الذكاء الاصطناعي للمستودع بشكل دائم. لا تتأثر محادثات Knowledge RAG. لا يمكن التراجع عن هذا الإجراء.
de: Alle Chat-Sitzungen des Repository-KI-Assistenten werden dauerhaft entfernt. Knowledge-RAG-Unterhaltungen sind nicht betroffen. Diese Aktion kann nicht rückgängig gemacht werden.
es: Todas las sesiones de chat del asistente de IA del repositorio se eliminarán permanentemente. Las conversaciones de RAG de conocimiento no se ven afectadas. Esta acción no se puede deshacer.
fr: Toutes les sessions de discussion de l'assistant IA du dépôt seront définitivement supprimées. Les conversations RAG de connaissances ne sont pas affectées. Cette action est irréversible.
id: Semua sesi obrolan asisten AI repo akan dihapus secara permanen. Percakapan Knowledge RAG tidak terpengaruh. Tindakan ini tidak dapat dibatalkan.
it: Tutte le sessioni chat dell'assistente AI del repository verranno rimosse permanentemente. Le conversazioni Knowledge RAG non vengono influenzate. Questa azione non può essere annullata.
ja: すべてのリポジトリAIアシスタントのチャットセッションが完全に削除されます。Knowledge RAGの会話は影響を受けません。この操作は元に戻せません。
ko: 모든 저장소 AI 어시스턴트 채팅 세션이 영구적으로 제거됩니다. Knowledge RAG 대화는 영향을 받지 않습니다. 이 작업은 실행 취소할 수 없습니다.
nl: Alle repo AI-assistent-chatsessies worden permanent verwijderd. Knowledge RAG-gesprekken worden niet beïnvloed. Deze actie kan niet ongedaan worden gemaakt.
pl: Wszystkie sesje czatu asystenta AI repozytorium zostaną trwale usunięte. Rozmowy Knowledge RAG nie są dotknięte. Tej operacji nie można cofnąć.
pt_br: Todas as sessões de chat do assistente de IA do repositório serão removidas permanentemente. As conversas do RAG de Conhecimento não são afetadas. Esta ação não pode ser desfeita.
ru: Все сеансы чата ИИ репозитория будут безвозвратно удалены. Разговоры Knowledge RAG не затрагиваются. Это действие нельзя отменить.
tr: Tüm depo AI asistan sohbet oturumları kalıcı olarak silinecektir. Knowledge RAG konuşmaları etkilenmez. Bu işlem geri alınamaz.
uk: Усі сеанси чату AI-помічника репозиторію буде остаточно видалено. Розмови Knowledge RAG не зачіпаються. Цю дію не можна скасувати.
vi: Tất cả phiên trò chuyện AI kho sẽ bị xóa vĩnh viễn. Các cuộc hội thoại RAG tri thức không bị ảnh hưởng. Hành động này không thể hoàn tác.
zh_hans: 所有仓库 AI 助手窗口下的对话都会被永久删除，不影响知识库 RAG 会话，不可恢复。
zh_hant: 所有仓库 AI 助手窗口下的对话都会被永久删除，不影响知识库 RAG 会话，不可恢复。

# settings.storage.clearCodebaseMemory.confirm
source: Clear all CodebaseMemory data?
ar: مسح كل بيانات CodebaseMemory؟
de: Alle CodebaseMemory-Daten löschen?
es: ¿Limpiar todos los datos de CodebaseMemory?
fr: Effacer toutes les données CodebaseMemory ?
id: Hapus semua data CodebaseMemory?
it: Cancellare tutti i dati CodebaseMemory?
ja: すべてのCodebaseMemoryデータをクリアしますか？
ko: 모든 CodebaseMemory 데이터를 지우시겠습니까?
nl: Alle CodebaseMemory-gegevens wissen?
pl: Wyczyścić wszystkie dane CodebaseMemory?
pt_br: Limpar todos os dados da CodebaseMemory?
ru: Очистить все данные CodebaseMemory?
tr: Tüm CodebaseMemory verileri temizlensin mi?
uk: Очистити всі дані CodebaseMemory?
vi: Xóa tất cả dữ liệu CodebaseMemory?
zh_hans: 清除全部 CodebaseMemory 数据？
zh_hant: 清除全部 CodebaseMemory 数据？

# settings.storage.clearCodebaseMemory.message
source: This will delete all 3D graph indexes and extracted source directories. Shared source ZIPs will not be deleted.
ar: سيؤدي هذا إلى حذف جميع فهارس الرسم البياني ثلاثي الأبعاد وأدلة المصدر المستخرجة. لن تُحذف ملفات ZIP المصدر المشتركة.
de: Dies löscht alle 3D-Graph-Indizes und extrahierten Quellverzeichnisse. Gemeinsame Quell-ZIPs werden nicht gelöscht.
es: Esto eliminará todos los índices de gráficos 3D y directorios de origen extraídos. Los ZIP de origen compartidos no se eliminarán.
fr: Cela supprimera tous les index de graphe 3D et les répertoires source extraits. Les ZIP sources partagés ne seront pas supprimés.
id: Ini akan menghapus semua indeks grafik 3D dan direktori sumber yang diekstrak. ZIP sumber bersama tidak akan dihapus.
it: Questo eliminerà tutti gli indici del grafico 3D e le directory sorgente estratte. I ZIP sorgente condivisi non verranno eliminati.
ja: これにより、すべての3Dグラフインデックスと抽出されたソースディレクトリが削除されます。共有ソースZIPは削除されません。
ko: 모든 3D 그래프 인덱스와 추출된 소스 디렉토리가 삭제됩니다. 공유 소스 ZIP은 삭제되지 않습니다.
nl: Dit verwijdert alle 3D-grafiekindexen en geëxtraheerde brondirectories. Gedeelde bron-ZIP's worden niet verwijderd.
pl: Spowoduje to usunięcie wszystkich indeksów grafów 3D i wyodrębnionych katalogów źródłowych. Współdzielone pliki ZIP źródłowe nie zostaną usunięte.
pt_br: Isso excluirá todos os índices de gráfico 3D e diretórios de origem extraídos. Os ZIPs de origem compartilhados não serão excluídos.
ru: Это удалит все индексы 3D-графа и извлечённые каталоги исходного кода. Общие ZIP-архивы не будут удалены.
tr: Bu, tüm 3B grafik indekslerini ve çıkarılan kaynak dizinlerini silecektir. Paylaşılan kaynak ZIP'leri silinmeyecektir.
uk: Це видалить усі індекси 3D-графів і витягнуті каталоги вихідного коду. Спільні ZIP-файли вихідного коду не будуть видалені.
vi: Thao tác này sẽ xóa tất cả chỉ mục đồ thị 3D và thư mục mã nguồn đã giải nén. Các tệp ZIP nguồn dùng chung sẽ không bị xóa.
zh_hans: 将删除所有 3D 图谱索引与解压源码目录。共享源码 ZIP 不会被删除。
zh_hant: 将删除所有 3D 图谱索引与解压源码目录。共享源码 ZIP 不会被删除。

# settings.storage.clearCodeFlow.confirm
source: Clear all CodeFlow data?
ar: مسح كل بيانات CodeFlow؟
de: Alle CodeFlow-Daten löschen?
es: ¿Limpiar todos los datos de CodeFlow?
fr: Effacer toutes les données CodeFlow ?
id: Hapus semua data CodeFlow?
it: Cancellare tutti i dati CodeFlow?
ja: すべてのCodeFlowデータをクリアしますか？
ko: 모든 CodeFlow 데이터를 지우시겠습니까?
nl: Alle CodeFlow-gegevens wissen?
pl: Wyczyścić wszystkie dane CodeFlow?
pt_br: Limpar todos os dados do CodeFlow?
ru: Очистить все данные CodeFlow?
tr: Tüm CodeFlow verileri temizlensin mi?
uk: Очистити всі дані CodeFlow?
vi: Xóa tất cả dữ liệu CodeFlow?
zh_hans: 清除全部 CodeFlow 数据?
zh_hant: 清除全部 CodeFlow 数据？

# settings.storage.clearCodeFlow.message
source: Deletes all CodeFlow HTML and metadata. Source ZIPs are kept.
ar: يحذف كل ملفات CodeFlow HTML والبيانات الوصفية. تُحفظ ملفات ZIP المصدر.
de: Löscht alle CodeFlow-HTML und Metadaten. Quell-ZIPs bleiben erhalten.
es: Elimina todo el HTML y metadatos de CodeFlow. Los ZIP de origen se conservan.
fr: Supprime tout le HTML et les métadonnées CodeFlow. Les ZIP sources sont conservés.
id: Menghapus semua HTML dan metadata CodeFlow. ZIP sumber tetap disimpan.
it: Elimina tutti i file HTML e metadati CodeFlow. I ZIP sorgente vengono conservati.
ja: すべてのCodeFlow HTMLとメタデータを削除します。ソースZIPは保持されます。
ko: 모든 CodeFlow HTML 및 메타데이터를 삭제합니다. 소스 ZIP은 유지됩니다.
nl: Verwijdert alle CodeFlow-HTML en metadata. Bron-ZIP's blijven behouden.
pl: Usuwa wszystkie pliki HTML i metadane CodeFlow. Źródłowe pliki ZIP pozostają.
pt_br: Exclui todos os HTML e metadados do CodeFlow. Os ZIPs de origem são mantidos.
ru: Удаляет все HTML и метаданные CodeFlow. Исходные ZIP-архивы сохраняются.
tr: Tüm CodeFlow HTML ve meta verilerini siler. Kaynak ZIP'ler korunur.
uk: Видаляє всі HTML-файли та метадані CodeFlow. Вихідні ZIP-файли зберігаються.
vi: Xóa tất cả HTML và metadata CodeFlow. Các tệp ZIP nguồn được giữ lại.
zh_hans: 将删除所有 CodeFlow HTML 与 metadata。共享源码 ZIP 不会被删除。
zh_hant: 将删除所有 CodeFlow HTML 与 metadata。共享源码 ZIP 不会被删除。

# settings.storage.clearImage.confirm
source: Clear image cache?
ar: مسح ذاكرة الصور المؤقتة؟
de: Bildercache löschen?
es: ¿Limpiar caché de imágenes?
fr: Effacer le cache d'images ?
id: Hapus cache gambar?
it: Cancellare la cache immagini?
ja: 画像キャッシュをクリアしますか？
ko: 이미지 캐시를 지우시겠습니까?
nl: Afbeeldingscache wissen?
pl: Wyczyścić pamięć podręczną obrazów?
pt_br: Limpar cache de imagens?
ru: Очистить кэш изображений?
tr: Resim önbelleği temizlensin mi?
uk: Очистити кеш зображень?
vi: Xóa bộ nhớ đệm hình ảnh?
zh_hans: 清空图片缓存?
zh_hant: 清空图片缓存？

# settings.storage.clearImage.message
source: Avatars and thumbnails will be re-downloaded as you scroll.
ar: ستُعاد تنزيل الصور الرمزية والصور المصغرة أثناء التمرير.
de: Avatare und Miniaturansichten werden beim Scrollen erneut heruntergeladen.
es: Los avatares y miniaturas se volverán a descargar mientras te desplazas.
fr: Les avatars et vignettes seront téléchargés à nouveau en défilant.
id: Avatar dan thumbnail akan diunduh ulang saat Anda menggulir.
it: Avatar e miniature verranno scaricati nuovamente durante lo scorrimento.
ja: アバターとサムネイルは、スクロールに応じて再ダウンロードされます。
ko: 스크롤할 때 아바타와 썸네일이 다시 다운로드됩니다.
nl: Avatars en miniaturen worden opnieuw gedownload terwijl u scrolt.
pl: Awatary i miniatury zostaną ponownie pobrane podczas przewijania.
pt_br: Avatares e miniaturas serão baixados novamente conforme você rolar.
ru: Аватары и миниатюры будут загружены заново при прокрутке.
tr: Avatarlar ve küçük resimler kaydırdıkça yeniden indirilecektir.
uk: Аватари та мініатюри буде завантажено повторно під час прокручування.
vi: Ảnh đại diện và hình thu nhỏ sẽ được tải lại khi bạn cuộn.
zh_hans: 头像与缩略图会在列表滚动时重新下载。
zh_hant: 头像与缩略图会在列表滚动时重新下载。

# settings.storage.clearing
source: Clearing…
ar: جارٍ المسح…
de: Wird geleert…
es: Borrando…
fr: Nettoyage en cours…
id: Menghapus…
it: Cancellazione in corso…
ja: クリア中…
ko: 지우는 중...
nl: Bezig met wissen…
pl: Czyszczenie…
pt_br: Limpando…
ru: Очистка…
tr: Temizleniyor…
uk: Очищення…
vi: Đang xóa…
zh_hans: 正在清理…
zh_hant: 正在清理…

# settings.storage.clearRAGHistory.confirm
source: Clear Knowledge RAG conversation history?
ar: مسح سجل محادثة Knowledge RAG؟
de: Knowledge-RAG-Konversationsverlauf löschen?
es: ¿Limpiar el historial de conversaciones de RAG de conocimiento?
fr: Effacer l'historique des conversations RAG de connaissances ?
id: Hapus riwayat percakapan Knowledge RAG?
it: Cancellare la cronologia conversazioni Knowledge RAG?
ja: Knowledge RAGの会話履歴をクリアしますか？
ko: Knowledge RAG 대화 기록을 지우시겠습니까?
nl: Knowledge RAG-gespreksgeschiedenis wissen?
pl: Wyczyścić historię rozmów Knowledge RAG?
pt_br: Limpar histórico de conversas do RAG de Conhecimento?
ru: Очистить историю разговоров Knowledge RAG?
tr: Knowledge RAG konuşma geçmişi temizlensin mi?
uk: Очистити історію розмов Knowledge RAG?
vi: Xóa lịch sử hội thoại RAG tri thức?
zh_hans: 清除知识库 RAG 会话历史？
zh_hant: 清除知识库 RAG 会话历史？

# settings.storage.clearRAGHistory.message
source: This deletes local RAG questions, answers, and citation metadata.
ar: يحذف هذا أسئلة وأجوبة RAG المحلية وبيانات الاستشهاد الوصفية.
de: Dies löscht lokale RAG-Fragen, Antworten und Zitationsmetadaten.
es: Esto elimina las preguntas, respuestas y metadatos de citas locales de RAG.
fr: Supprime les questions, réponses et métadonnées de citation RAG locales.
id: Ini menghapus pertanyaan, jawaban, dan metadata kutipan RAG lokal.
it: Questo elimina domande, risposte e metadati citazione RAG locali.
ja: これにより、ローカルのRAGの質問、回答、引用メタデータが削除されます。
ko: 로컬 RAG 질문, 답변 및 인용 메타데이터가 삭제됩니다.
nl: Dit verwijdert lokale RAG-vragen, antwoorden en citatiemetadata.
pl: Spowoduje to usunięcie lokalnych pytań, odpowiedzi i metadanych cytowań RAG.
pt_br: Isso exclui perguntas, respostas e metadados de citação do RAG local.
ru: Это удаляет локальные вопросы RAG, ответы и метаданные цитирования.
tr: Bu, yerel RAG sorularını, yanıtlarını ve alıntı meta verilerini siler.
uk: Це видаляє локальні запитання, відповіді та метадані цитування RAG.
vi: Thao tác này xóa các câu hỏi, câu trả lời và siêu dữ liệu trích dẫn RAG cục bộ.
zh_hans: 这会删除本地 RAG 问题、回答和引用元数据。
zh_hant: 这会删除本地 RAG 问题、回答和引用元数据。

# settings.storage.clearRAGIndex.confirm
source: Clear the RAG index?
ar: مسح فهرس RAG؟
de: RAG-Index löschen?
es: ¿Limpiar el índice RAG?
fr: Effacer l'index RAG ?
id: Hapus indeks RAG?
it: Cancellare l'indice RAG?
ja: RAGインデックスをクリアしますか？
ko: RAG 인덱스를 지우시겠습니까?
nl: RAG-index wissen?
pl: Wyczyścić indeks RAG?
pt_br: Limpar o índice RAG?
ru: Очистить индекс RAG?
tr: RAG indeksi temizlensin mi?
uk: Очистити індекс RAG?
vi: Xóa chỉ mục RAG?
zh_hans: 清除 RAG 索引？
zh_hant: 清除 RAG 索引？

# settings.storage.clearRAGIndex.message
source: This only deletes rebuildable chunks and embeddings. Repository data, README, notes, summaries, and library state are unchanged.
ar: يحذف هذا فقط الأجزاء والتضمينات القابلة لإعادة البناء. لا تتغير بيانات المستودع و README والملاحظات والملخصات وحالة المكتبة.
de: Dies löscht nur wiederherstellbare Chunks und Embeddings. Repository-Daten, README, Notizen, Zusammenfassungen und Bibliotheksstatus bleiben unverändert.
es: Esto solo elimina fragmentos y embeddings reconstruibles. Los datos del repositorio, README, notas, resúmenes y estado de la biblioteca no se modifican.
fr: Supprime uniquement les chunks et embeddings reconstructibles. Les données de dépôt, README, notes, résumés et l'état de la bibliothèque sont inchangés.
id: Ini hanya menghapus potongan dan embedding yang dapat dibangun ulang. Data repositori, README, catatan, ringkasan, dan status pustaka tidak berubah.
it: Questo elimina solo chunk e embedding ricostruibili. Dati repository, README, note, riepiloghi e stato libreria rimangono invariati.
ja: これにより、再構築可能なチャンクと埋め込みのみが削除されます。リポジトリデータ、README、メモ、要約、ライブラリの状態は変更されません。
ko: 재구성 가능한 청크와 임베딩만 삭제됩니다. 저장소 데이터, README, 노트, 요약 및 라이브러리 상태는 변경되지 않습니다.
nl: Dit verwijdert alleen herbouwbare chunks en embeddings. Repositorygegevens, README, notities, samenvattingen en bibliotheekstatus blijven ongewijzigd.
pl: Spowoduje to usunięcie tylko możliwych do odtworzenia fragmentów i osadzeń. Dane repozytorium, README, notatki, podsumowania i stan biblioteki pozostają bez zmian.
pt_br: Isso exclui apenas blocos e embeddings reconstruíveis. Dados do repositório, README, notas, resumos e estado da biblioteca permanecem inalterados.
ru: Это удаляет только восстанавливаемые фрагменты и эмбеддинги. Данные репозитория, README, заметки, сводки и состояние библиотеки не изменяются.
tr: Bu yalnızca yeniden oluşturulabilir parçaları ve yerleştirmeleri siler. Depo verileri, README, notlar, özetler ve kütüphane durumu değişmez.
uk: Це видаляє лише відновлювані фрагменти та векторизацію. Дані репозиторію, README, нотатки, підсумки та стан бібліотеки не змінюються.
vi: Thao tác này chỉ xóa các khối và embedding có thể xây dựng lại. Dữ liệu kho, README, ghi chú, tóm tắt và trạng thái thư viện không thay đổi.
zh_hans: 仅删除可重建的分片和向量；仓库数据、README、笔记、摘要和知识库状态不受影响。
zh_hant: 仅删除可重建的分片和向量；仓库数据、README、笔记、摘要和知识库状态不受影响。

# settings.storage.clearReadme.confirm
source: Clear README cache?
ar: مسح ذاكرة README المؤقتة؟
de: README-Cache löschen?
es: ¿Limpiar caché de README?
fr: Effacer le cache README ?
id: Hapus cache README?
it: Cancellare la cache README?
ja: READMEキャッシュをクリアしますか？
ko: README 캐시를 지우시겠습니까?
nl: README-cache wissen?
pl: Wyczyścić pamięć podręczną README?
pt_br: Limpar cache de README?
ru: Очистить кэш README?
tr: README önbelleği temizlensin mi?
uk: Очистити кеш README?
vi: Xóa bộ nhớ đệm README?
zh_hans: 清空 README 缓存?
zh_hant: 清空 README 缓存？

# settings.storage.clearReadme.message
source: README will be re-fetched from GitHub when you browse the repo.
ar: ستُعاد جلب README من GitHub عند تصفح المستودع.
de: README wird beim Durchsuchen des Repositorys erneut von GitHub abgerufen.
es: El README se volverá a obtener de GitHub cuando navegues por el repositorio.
fr: Le README sera récupéré depuis GitHub lorsque vous parcourrez le dépôt.
id: README akan diambil ulang dari GitHub saat Anda menjelajahi repo.
it: Il README verrà recuperato nuovamente da GitHub quando sfoglierai il repository.
ja: リポジトリを閲覧する際に、READMEがGitHubから再取得されます。
ko: 저장소를 탐색할 때 README가 GitHub에서 다시 가져와집니다.
nl: README wordt opnieuw opgehaald van GitHub wanneer u de repo bekijkt.
pl: README zostanie ponownie pobrane z GitHub podczas przeglądania repozytorium.
pt_br: O README será buscado novamente do GitHub quando você navegar pelo repositório.
ru: README будет повторно загружен с GitHub при просмотре репозитория.
tr: Depoya göz attığınızda README GitHub'dan yeniden getirilecektir.
uk: README буде повторно завантажено з GitHub під час перегляду репозиторію.
vi: README sẽ được tải lại từ GitHub khi bạn duyệt kho.
zh_hans: 下次浏览仓库时会重新从 GitHub 抓取。
zh_hant: 下次浏览仓库时会重新从 GitHub 获取。

# settings.storage.clearRecommendation.confirm
source: Clear recommendation cache?
ar: هل تريد مسح ذاكرة التوصيات المؤقتة؟
de: Empfehlungs-Cache leeren?
es: ¿Borrar caché de recomendaciones?
fr: Effacer le cache des recommandations ?
id: Hapus cache rekomendasi?
it: Cancellare la cache delle raccomandazioni?
ja: おすすめキャッシュをクリアしますか？
ko: 추천 캐시를 지우시겠습니까?
nl: Aanbevelingscache wissen?
pl: Wyczyścić pamięć podręczną rekomendacji?
pt_br: Limpar cache de recomendações?
ru: Очистить кеш рекомендаций?
tr: Öneri önbelleği temizlensin mi?
uk: Очистити кеш рекомендацій?
vi: Xóa bộ nhớ đệm đề xuất?
zh_hans: 确定清除推荐缓存？
zh_hant: 确定清除推荐缓存？

# settings.storage.clearRecommendation.message
source: All cached similar-repository results will be removed. The next time you open a repo detail, recommendations will be fetched again.
ar: ستتم إزالة جميع نتائج المستودعات المشابهة المخزنة مؤقتًا. في المرة القادمة التي تفتح فيها تفاصيل مستودع، سيتم جلب التوصيات مرة أخرى.
de: Alle zwischengespeicherten Ergebnisse für ähnliche Repos werden entfernt. Beim nächsten Öffnen eines Repo-Details werden die Empfehlungen erneut abgerufen.
es: Se eliminarán todos los resultados cacheados de repositorios similares. La próxima vez que abras un detalle de repositorio, las recomendaciones se obtendrán de nuevo.
fr: Tous les résultats de dépôts similaires mis en cache seront supprimés. La prochaine fois que vous ouvrirez un détail de dépôt, les recommandations seront récupérées à nouveau.
id: Semua hasil repositori serupa yang di-cache akan dihapus. Saat Anda membuka detail repo lagi, rekomendasi akan diambil ulang.
it: Tutti i risultati di repository simili memorizzati nella cache verranno rimossi. La prossima volta che aprirai un dettaglio del repository, le raccomandazioni verranno recuperate di nuovo.
ja: キャッシュされたすべての類似リポジトリ結果が削除されます。次にリポジトリ詳細を開いたときに、おすすめが再度取得されます。
ko: 캐시된 모든 유사 저장소 결과가 제거됩니다. 다음에 저장소 상세를 열 때 추천을 다시 가져옵니다.
nl: Alle gecachte resultaten van vergelijkbare repositories worden verwijderd. De volgende keer dat je een repo-detail opent, worden aanbevelingen opnieuw opgehaald.
pl: Wszystkie zapisane wyniki podobnych repozytoriów zostaną usunięte. Przy następnym otwarciu szczegółów repozytorium rekomendacje zostaną pobrane ponownie.
pt_br: Todos os resultados em cache de repositórios similares serão removidos. Na próxima vez que você abrir os detalhes de um repositório, as recomendações serão buscadas novamente.
ru: Все кешированные результаты похожих репозиториев будут удалены. При следующем открытии деталей репозитория рекомендации будут загружены заново.
tr: Önbelleğe alınmış tüm benzer-depo sonuçları kaldırılacak. Bir sonraki depo detayını açtığınızda öneriler yeniden getirilecek.
uk: Усі кешовані результати схожих репозиторіїв буде видалено. Наступного разу, коли ви відкриєте деталі репозиторію, рекомендації буде отримано знову.
vi: Tất cả kết quả kho lưu trữ tương tự đã lưu trong bộ nhớ đệm sẽ bị xóa. Lần tới khi bạn mở chi tiết kho lưu trữ, các đề xuất sẽ được tải lại.
zh_hans: 所有缓存的相似推荐结果都会被删除。下次打开 repo 详情时会重新拉取推荐。
zh_hant: 所有缓存的相似推荐结果都会被删除。下次打开仓库详情时会重新获取推荐。

# settings.storage.clearTranslation
source: Clear Translation Cache
ar: مسح ذاكرة الترجمة المؤقتة
de: Übersetzungs-Cache leeren
es: Borrar caché de traducciones
fr: Vider le cache de traduction
id: Hapus Cache Terjemahan
it: Cancella cache traduzioni
ja: 翻訳キャッシュをクリア
ko: 번역 캐시 지우기
nl: Vertaalcache wissen
pl: Wyczyść pamięć podręczną tłumaczeń
pt_br: Limpar Cache de Tradução
ru: Очистить кеш переводов
tr: Çeviri Önbelleğini Temizle
uk: Очистити кеш перекладів
vi: Xóa Bộ nhớ đệm Dịch thuật
zh_hans: 清除翻译缓存
zh_hant: 清除翻译缓存

# settings.storage.clearTranslation.action
source: Clear
ar: مسح
de: Leeren
es: Borrar
fr: Vider
id: Hapus
it: Cancella
ja: クリア
ko: 지우기
nl: Wissen
pl: Wyczyść
pt_br: Limpar
ru: Очистить
tr: Temizle
uk: Очистити
vi: Xóa
zh_hans: 清除
zh_hant: 清除

# settings.storage.clearTranslation.confirm
source: Clear all translation cache?
ar: هل تريد مسح كل ذاكرة الترجمة المؤقتة؟
de: Gesamten Übersetzungs-Cache leeren?
es: ¿Borrar toda la caché de traducciones?
fr: Vider tout le cache de traduction ?
id: Hapus semua cache terjemahan?
it: Cancellare tutta la cache delle traduzioni?
ja: すべての翻訳キャッシュをクリアしますか？
ko: 모든 번역 캐시를 지우시겠습니까?
nl: Alle vertaalcache wissen?
pl: Wyczyścić całą pamięć podręczną tłumaczeń?
pt_br: Limpar todo o cache de tradução?
ru: Очистить весь кеш переводов?
tr: Tüm çeviri önbelleği temizlensin mi?
uk: Очистити весь кеш перекладів?
vi: Xóa tất cả bộ nhớ đệm dịch thuật?
zh_hans: 确认清除全部翻译缓存？
zh_hant: 确认清除全部翻译缓存？

# settings.storage.clearTranslation.message
source: All cached translations will be removed. Repos can be re-translated on demand; AI quota will be spent again.
ar: ستتم إزالة جميع الترجمات المخزنة مؤقتًا. يمكن إعادة ترجمة المستودعات عند الطلب؛ وسيتم استهلاك حصة الذكاء الاصطناعي مرة أخرى.
de: Alle zwischengespeicherten Übersetzungen werden entfernt. Repos können bei Bedarf neu übersetzt werden; dabei wird erneut KI-Kontingent verbraucht.
es: Se eliminarán todas las traducciones cacheadas. Los repositorios se pueden volver a traducir bajo demanda; se consumirá cuota de IA nuevamente.
fr: Toutes les traductions mises en cache seront supprimées. Les dépôts peuvent être retraduits à la demande ; le quota IA sera à nouveau utilisé.
id: Semua terjemahan yang di-cache akan dihapus. Repo dapat diterjemahkan ulang sesuai permintaan; kuota AI akan digunakan lagi.
it: Tutte le traduzioni memorizzate nella cache verranno rimosse. I repository possono essere ritradotti su richiesta; la quota AI verrà consumata di nuovo.
ja: キャッシュされたすべての翻訳が削除されます。リポジトリは必要に応じて再翻訳できます。その際、AIクォータが再度消費されます。
ko: 캐시된 모든 번역이 제거됩니다. 저장소는 필요 시 다시 번역할 수 있으며, AI 할당량이 다시 소모됩니다.
nl: Alle gecachte vertalingen worden verwijderd. Repo's kunnen op verzoek opnieuw worden vertaald; AI-quotum wordt opnieuw verbruikt.
pl: Wszystkie zapisane tłumaczenia zostaną usunięte. Repozytoria można ponownie przetłumaczyć na żądanie; limit AI zostanie ponownie wykorzystany.
pt_br: Todas as traduções em cache serão removidas. Os repositórios podem ser retraduzidos sob demanda; a cota de IA será consumida novamente.
ru: Все кешированные переводы будут удалены. Репозитории можно перевести повторно по запросу; квота ИИ будет израсходована снова.
tr: Önbelleğe alınmış tüm çeviriler kaldırılacak. Depolar isteğe bağlı olarak yeniden çevrilebilir; AI kotası tekrar harcanacak.
uk: Усі кешовані переклади буде видалено. Репозиторії можна повторно перекласти за запитом; квота ШІ буде витрачена знову.
vi: Tất cả bản dịch đã lưu trong bộ nhớ đệm sẽ bị xóa. Các kho lưu trữ có thể được dịch lại theo yêu cầu; hạn mức AI sẽ được sử dụng lại.
zh_hans: 已缓存的所有译文将被清空。仓库仍可按需重新翻译，需要重新消耗 AI 配额。
zh_hant: 已缓存的所有译文将被清空。仓库仍可按需重新翻译，需要重新消耗 AI 配额。

# settings.storage.clearWiki.confirm
source: Clear all Wiki probe cache?
ar: هل تريد مسح كل ذاكرة فحص الويكي المؤقتة؟
de: Gesamten Wiki-Probe-Cache leeren?
es: ¿Borrar toda la caché de sondas Wiki?
fr: Vider tout le cache de sondage Wiki ?
id: Hapus semua cache probe Wiki?
it: Cancellare tutta la cache dei sondaggi Wiki?
ja: すべてのWikiプローブキャッシュをクリアしますか？
ko: 모든 Wiki 프로브 캐시를 지우시겠습니까?
nl: Alle Wiki-probecache wissen?
pl: Wyczyścić całą pamięć podręczną sondowania Wiki?
pt_br: Limpar todo o cache de sondagem Wiki?
ru: Очистить весь кеш Wiki-зондов?
tr: Tüm Wiki yoklama önbelleği temizlensin mi?
uk: Очистити весь кеш Wiki-зондування?
vi: Xóa tất cả bộ nhớ đệm thăm dò Wiki?
zh_hans: 确认清除全部 Wiki 探测缓存？
zh_hant: 确认清除全部 Wiki 探测缓存？
